module.exports = [
    {
        title: 'აპლიკაციები',
        body: `
        <strong>აპლიკაციების დამზადება</strong> — ვქმნით მაღალი ხარისხის მობილურ აპლიკაციებს როგორც iOS, ასევე Android პლატფორმებისთვის.  
        ვიყენებთ თანამედროვე ტექნოლოგიებს, რაც უზრუნველყოფს სწრაფ, სტაბილურ და მრავალფუნქციურ განვითარებას.
        `
    },
    {
        title: 'ვებ საიტები',
        body: `
        <strong>საიტების დამზადება</strong> - ვქმნით თანამედროვე, სწრაფ და უსაფრთხო ვებ პლატფორმებს, სრულიად მორგებულს თქვენს ბიზნესზე.
        `
    },
    {
        title: 'UI / UX დიზაინი',
        body: `
        ვქმნით ინტუიციურ, თანამედროვე და ვიზუალურად მიმზიდველ UI/UX დიზაინს როგორც ვებსაიტებისთვის, ასევე მობილური აპლიკაციებისთვის.
        `
    },
    {
        title: 'სტარტაპერებისთვის',
        body: `
        ეფექტურად ვქმნით პროდუქტის MVP ვერსიას. ვასრულებთ სრული ციკლის პროცესს: იდეის დასტური, ფუნქციების შერჩევა, UX/UI დიზაინი და 
        სწრაფი დეველოპმენტი. ჩვენი მიზანია მიიღოთ რეალური მომხმარებლის უკუკავშირი და გაამზადოთ პროდუქტი ინვესტორებისათვის.
        `
    }
]
