"use client"

import React from 'react'
import styles from './styles.module.scss'
import SectionText from '@components/SectionText/SectionText'
import { Card } from '@components/Card';


export const About = () => {
    const title = 'რატომ WooCommerce?'
    const data = [
        {
            icon: `
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path d="M96 128C78.3 128 64 142.3 64 160C64 177.7 78.3 192 96 192L182.7 192C195 220.3 223.2 240 256 240C288.8 240 317 220.3 329.3 192L544 192C561.7 192 576 177.7 576 160C576 142.3 561.7 128 544 128L329.3 128C317 99.7 288.8 80 256 80C223.2 80 195 99.7 182.7 128L96 128zM96 288C78.3 288 64 302.3 64 320C64 337.7 78.3 352 96 352L342.7 352C355 380.3 383.2 400 416 400C448.8 400 477 380.3 489.3 352L544 352C561.7 352 576 337.7 576 320C576 302.3 561.7 288 544 288L489.3 288C477 259.7 448.8 240 416 240C383.2 240 355 259.7 342.7 288L96 288zM96 448C78.3 448 64 462.3 64 480C64 497.7 78.3 512 96 512L150.7 512C163 540.3 191.2 560 224 560C256.8 560 285 540.3 297.3 512L544 512C561.7 512 576 497.7 576 480C576 462.3 561.7 448 544 448L297.3 448C285 419.7 256.8 400 224 400C191.2 400 163 419.7 150.7 448L96 448z"/></svg>
            `,
            title: `შეუზღუდავი პერსონალიზაცია`,
            text: `დიზაინიდან ფუნქციონალამდე, მოარგეთ თქვენი მაღაზიის ყველა ასპექტი თქვენს უნიკალურ ბრენდს.`,
        },
        {
            icon: `
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path d="M416 224C398.3 224 384 209.7 384 192C384 174.3 398.3 160 416 160L576 160C593.7 160 608 174.3 608 192L608 352C608 369.7 593.7 384 576 384C558.3 384 544 369.7 544 352L544 269.3L374.6 438.7C362.1 451.2 341.8 451.2 329.3 438.7L224 333.3L86.6 470.6C74.1 483.1 53.8 483.1 41.3 470.6C28.8 458.1 28.8 437.8 41.3 425.3L201.3 265.3C213.8 252.8 234.1 252.8 246.6 265.3L352 370.7L498.7 224L416 224z"/></svg>   
            `,
            title: `მასშტაბირება ზრდისთვის`,
            text: `გაქვთ 10 პროდუქტი თუ 10,000, WooCommerce თქვენს ბიზნესთან ერთად გაიზრდება.`,
        },
        {
            icon: `
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path d="M512 176C520.8 176 528 183.2 528 192L528 224L112 224L112 192C112 183.2 119.2 176 128 176L512 176zM528 288L528 448C528 456.8 520.8 464 512 464L128 464C119.2 464 112 456.8 112 448L112 288L528 288zM128 128C92.7 128 64 156.7 64 192L64 448C64 483.3 92.7 512 128 512L512 512C547.3 512 576 483.3 576 448L576 192C576 156.7 547.3 128 512 128L128 128zM144 408C144 421.3 154.7 432 168 432L216 432C229.3 432 240 421.3 240 408C240 394.7 229.3 384 216 384L168 384C154.7 384 144 394.7 144 408zM288 408C288 421.3 298.7 432 312 432L376 432C389.3 432 400 421.3 400 408C400 394.7 389.3 384 376 384L312 384C298.7 384 288 394.7 288 408z"/></svg>    
            `,
            title: `ხარჯთ-ეფექტური გადაწყვეტა`,
            text: `ღია კოდის პლატფორმა გთავაზობთ მძლავრ, მაგრამ ხელმისაწვდომ ალტერნატივას.`,
        },
        {
            icon: `
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path d="M480 272C480 317.9 465.1 360.3 440 394.7L566.6 521.4C579.1 533.9 579.1 554.2 566.6 566.7C554.1 579.2 533.8 579.2 521.3 566.7L394.7 440C360.3 465.1 317.9 480 272 480C157.1 480 64 386.9 64 272C64 157.1 157.1 64 272 64C386.9 64 480 157.1 480 272zM272 416C351.5 416 416 351.5 416 272C416 192.5 351.5 128 272 128C192.5 128 128 192.5 128 272C128 351.5 192.5 416 272 416z"/></svg>    
            `,
            title: `SEO-ზე მორგებული`,
            text: `WordPress-ზე დაფუძნებული პლატფორმა გთავაზობთ საუკეთესო SEO ინსტრუმენტებს.`,
        }
    ]
    return (
        <div className='container'>
            <div className='d-flex justify-content-center'>
                <SectionText title={'რატომ WooCommerce'} />
            </div>
            <div className='row'>
                {data && data?.map((item) => {
                    return (
                        <div className='col-md-6 col-lg-3' key={item.title}>
                            <Card
                                title={item.title}
                                text={item.text}
                                icon={item.icon}
                            />
                        </div>
                    )
                })}
            </div>
        </div>
    )
}
